[
  {
    "id": 0,
    "genre": "it",
    "cover": "../source/book_pics/clean_code.png",
    "title": "Чистый код",
    "author": "Роберт Мартин",
    "description": "Даже плохой программный код может работать. Однако если код не является «чистым», это всегда будет мешать развитию проекта и компании-разработчика, отнимая значительные ресурсы на его поддержку и «укрощение».\n\nЭта книга посвящена хорошему программированию. Она полна реальных примеров кода. Мы будем рассматривать код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Прочитав книгу, вы узнаете много нового о коде. Более того, вы научитесь отличать хороший код от плохого. Вы узнаете, как писать хороший код и как преобразовать плохой код в хороший.\n\nКнига состоит из трех частей. В первой части излагаются принципы, паттерны и приемы написания чистого кода; приводится большой объем примеров кода. Вторая часть состоит из практических сценариев нарастающей сложности. Каждый сценарий представляет собой упражнение по чистке кода или преобразованию проблемного кода в код с меньшим количеством проблем. Третья часть книги – концентрированное выражение ее сути. Она состоит из одной главы с перечнем эвристических правил и «запахов кода», собранных во время анализа. Эта часть представляет собой базу знаний, описывающую наш путь мышления в процессе чтения, написания и чистки кода.",
    "rating": {
      "value": 4.0,
      "votes": 104
    },
    "price": 599
  },
  {
    "id": 1,
    "genre": "it",
    "cover": "../source/book_pics/grokking_algorithms.png",
    "title": "Грокаем алгоритмы",
    "author": "Адитья Бхаргава",
    "description": "Принято считать, что программирование – это очень сложно. Особенно если раз за разом наступать на одни и те же грабли, пытаться сделать по-своему то, что уже и так было придумано до нас. Ведь практически для любой задачи есть готовый алгоритм решения, осталось только найти его и правильно использовать.\n\nВ книге «Грокаем алгоритмы» Адитья Бхаргава не просто показывает примеры таких решений с детальными иллюстрациями, но и учит читателя самостоятельно находить их в дальнейшем. Читатель знакомится с понятиями бинарного поиска, массивами, связанными списками, структурами данных, рекурсией.\n\nКнига рассчитана на тех, кто уже знаком с основными азами программирования и интересуется алгоритмическими решениями. Автор старается доносить информацию понятным даже новичку языком, иллюстрирует все основные моменты.",
    "rating": {
      "value": 4.6,
      "votes": 211
    },
    "price": 599
  },
  {
    "id": 2,
    "genre": "it",
    "cover": "../source/book_pics/operating_system.png",
    "title": "Современные операционные системы. 4-е издание",
    "author": "Эндрю Таненбаум, Херберт Бос",
    "description": "Эндрю Таненбаум представляет новое издание своего всемирного бестселлера, необходимое для понимания функционирования современных операционных систем. Оно существенно отличается от предыдущего и включает в себя сведения о последних достижениях в области информационных технологий. Например, глава о Windows Vista теперь заменена подробным рассмотрением Windows 8.1 как самой актуальной версии на момент написания книги. Появился объемный раздел, посвященный операционной системе Android. Был обновлен материал, касающийся Unix и Linux, а также RAID-систем. Гораздо больше внимания уделено мультиядерным и многоядерным системам, важность которых в последние несколько лет постоянно возрастает. Появилась совершенно новая глава о виртуализации и облачных вычислениях. Добавился большой объем нового материала об использовании ошибок кода, о вредоносных программах и соответствующих мерах защиты. В книге в ясной и увлекательной форме приводится множество важных подробностей, которых нет ни в одном другом издании.",
    "rating": {
      "value": 3.9,
      "votes": 42
    },
    "price": 699
  },
  {
    "id": 3,
    "genre": "it",
    "cover": "../source/book_pics/go.png",
    "title": "Go. Идиомы и паттерны проектирования",
    "author": "Джон Боднер",
    "description": "Go быстро набирает популярность в качестве языка для создания веб-сервисов. Существует множество учебников по синтаксису Go, но знать его недостаточно. Автор Джон Боднер описывает и объясняет паттерны проектирования, используемые опытными разработчиками. В книге собрана наиболее важная информация, необходимая для написания чистого и идиоматического Go-кода. Вы научитесь думать как Go-разработчик, вне зависимости от предыдущего опыта программирования.\n\nПосле покупки предоставляется дополнительная возможность скачать книгу в формате epub.",
    "rating": {
      "value": 4.2,
      "votes": 12
    },
    "price": 699
  },
  {
    "id": 4,
    "genre": "it",
    "cover": "../source/book_pics/sql.png",
    "title": "SQL. Быстрое погружение",
    "author": "Уолтер Шилдс",
    "description": "Что общего между самыми востребованными профессиями и стремительным увеличением количества информации в мире? Ответ: язык структурированных запросов (SQL). SQL – рабочая лошадка среди языков программирования, основа основ для современного анализа и управления данными.\n\nКнига «SQL: быстрое погружение» идеальна для всех, кто ищет новые перспективы карьерного роста; для разработчиков, которые хотят расширить свои навыки и знания в программировании; для любого человека, даже без опыта, кто хочет воспользоваться возможностями будущего, в котором будут править данные.\n\nПосле покупки предоставляется дополнительная возможность скачать книгу в формате epub.",
    "rating": {
      "value": 4.3,
      "votes": 24
    },
    "price": 599
  },
  {
    "id": 5,
    "genre": "it",
    "cover": "../source/book_pics/clean_arch.png",
    "title": "Чистая архитектура. Искусство разработки программного обеспечения",
    "author": "Роберт Мартин",
    "description": "«Идеальный программист» и «Чистый код» – легендарные бестселлеры Роберта Мартина – рассказывают, как достичь высот профессионализма. «Чистая архитектура» продолжает эту тему, но не предлагает несколько вариантов в стиле «решай сам», а объясняет, что именно следует делать, по какой причине и почему именно такое решение станет принципиально важным для вашего успеха.\n\nРоберт Мартин дает прямые и лаконичные ответы на ключевые вопросы архитектуры и дизайна. «Чистую архитектуру» обязаны прочитать разработчики всех уровней, системные аналитики, архитекторы и каждый программист, который желает подняться по карьерной лестнице или хотя бы повлиять на людей, которые занимаются данной работой.",
    "rating": {
      "value": 4.5,
      "votes": 14
    },
    "price": 600
  },
  {
    "id": 6,
    "genre": "it",
    "cover": "../source/book_pics/learn_python.png",
    "title": "Изучаем Python: программирование игр, визуализация данных, веб-приложения",
    "author": "Эрик Мэтиз",
    "description": "«Изучаем Python» – это самое популярное в мире руководство по языку Python. Вы сможете максимально быстро освоить Python, научитесь писать программы, устранять ошибки и создавать работающие приложения.\n\nВ первой части книги вы познакомитесь с основными концепциями программирования, такими как переменные, списки, классы и циклы, а простые упражнения познакомят вас с шаблонами чистого кода. Вы узнаете, как делать программы интерактивными и как протестировать код, прежде чем добавлять в проект. Во второй части вы примените новые знания на практике и создадите три проекта: аркадную игру в стиле Space Invaders, визуализацию данных с удобными библиотеками Python и простое веб-приложение, которое можно быстро развернуть онлайн.",
    "rating": {
      "value": 4.2,
      "votes": 73
    },
    "price": 699
  },
  {
    "id": 7,
    "genre": "it",
    "cover": "../source/book_pics/ai_pract.png",
    "title": "Нейросети практика",
    "author": "Джейд Картер",
    "description": "Книга предлагает полное погружение в мир нейросетей, начиная с основных концепций и методов обучения и до сложных алгоритмов и техник. Читателю предоставляются понятные объяснения и примеры, а также многочисленные практические задания и проекты для непосредственного применения знаний. Вы научитесь обрабатывать и анализировать данные, решать задачи классификации, регрессии и генерации, а также создавать собственные модели нейросетей. \"Нейросети практика\" - это источник вдохновения и практического опыта, необходимый для приведения идей к жизни с помощью нейросетей.",
    "rating": {
      "value": 5.0,
      "votes": 125
    },
    "price": 690
  },
  {
    "id": 8,
    "genre": "it",
    "cover": "../source/book_pics/doom.png",
    "title": "Повелители DOOM. Как два парня создали культовый шутер...",
    "author": "Дэвид Кушнер",
    "description": "В 2018 году легендарной игре DOOM исполнилось 25 лет. Книга «Повелители DOOM» – это реальная история двух молодых людей, которых объединила любовь к видеоиграм. Им удалось за короткий срок навсегда изменить устои игропрома. За пару месяцев вместе с маленькой командой они создали культовую, революционную игру, которую сегодня любят миллионы геймеров по всему миру. DOOM стал первым шутером от первого лица.\n\nЭта книга дает читателям возможность познакомиться с создателями легендарной игрушки – Джоном Кармаком и Джоном Ромеро. Ведомые страстью к видеоиграм, они пришли к успеху без чьей-либо помощи и протекции. На их пути были и взлеты, и падения, после которых было очень сложно подниматься на ноги. Но они шли дальше. И наконец-то пришли к долгожданной мечте.\n\nКнига «Повелители DOOM. Как два парня создали культовый шутер и раскачали индустрию видеоигр» рекомендована к прочтению истинным фанатам DOOM и других компьютерных игр.",
    "rating": {
      "value": 4.7,
      "votes": 230
    },
    "price": 690
  },
  {
    "id": 9,
    "genre": "it",
    "cover": "../source/book_pics/linux.png",
    "title": "Linux. Руководство программиста",
    "author": "Джон Фуско",
    "description": "Данное руководство позволит вам освоить обширный перечень инструментов с открытым исходным кодом, доступных для GNU/Linux. Автор книги, Джон Фуско, подробно и доступно описывает наиболее полезные из них, используя наглядные краткие примеры, которые легко видоизменять и использовать на практике.\n\nНачав с самых основ – загрузки, построения и установки, – вы узнаете, как распределены инструменты с открытым кодом и как найти оптимальное решение для той или иной задачи, углубите свои знания о ядре Linux и способах взаимодействия ОС с программным обеспечением.\n\nИзложение теоретической информации в книге ориентировано на последующее практическое применение. Освоив ее, вы сможете пользоваться самыми продвинутыми инструментами, применяя их для разработки собственных приложений, а также для увеличения производительности ПО и его отладки.",
    "rating": {
      "value": 4.4,
      "votes": 10
    },
    "price": 250
  },
  {
    "id": 10,
    "genre": "it",
    "cover": "../source/book_pics/astra.png",
    "title": "Astra Linux. Руководство по национальной операционной системе...",
    "author": "Елена Вовк",
    "description": "Практическое руководство по использованию российской операционной системы Astra Linux.\n\nКнига знакомит с особенностями операционной системы, набирающей популярность в последние годы. Вы научитесь работать с текстовым редактором LibreOffice Writer, с электронными таблицами LibreOffice Calc и презентациями LibreOffice Impress. Кроме того, автор рассказывает о специальных настройках, действиях с файлами и папками, а также дает советы, как сделать работу с Astra Linux комфортной.",
    "rating": {
      "value": 3.8,
      "votes": 8
    },
    "price": 449
  },
  {
    "id": 11,
    "genre": "it",
    "cover": "../source/book_pics/apache.png",
    "title": "Apache Kafka. Потоковая обработка и анализ данных",
    "author": "Гвен Шапира, Тодд Палино",
    "description": "При работе любого enterprise-приложения образуются данные: это файлы логов, метрики, информация об активности пользователей, исходящие сообщения и т. п. Правильные манипуляции над всеми этими данными не менее важны, чем сами данные. Если вы – архитектор, разработчик или выпускающий инженер, желающий решать подобные проблемы, но пока не знакомы с Apache Kafka, то именно отсюда узнаете, как работать с этой свободной потоковой платформой, позволяющей обрабатывать очереди данных в реальном времени.\n\nПосле покупки предоставляется дополнительная возможность скачать книгу в формате epub.",
    "rating": {
      "value": 4.2,
      "votes": 28
    },
    "price": 649
  },
  {
    "id": 12,
    "genre": "science_fiction",
    "cover": "../source/book_pics/marionette.png",
    "title": "Марионетка",
    "author": "Полина Дашкова",
    "description": "Уезжая отдыхать и надеясь хорошо провести время на юге, Маша представить не могла, что она окажется заложницей в руках чеченских боевиков, станет свидетельницей гибели многих людей, чудом останется жива – и встретится с человеком, которого полюбит…Ранее книга издавалась под названием «Чеченская марионетка, или Продажные твари»",
    "rating": {
      "value": 4.6,
      "votes": 128
    },
    "price": 339
  },
  {
    "id": 13,
    "genre": "science_fiction",
    "cover": "../source/book_pics/fila_vitae.png",
    "title": "Fila vitae. Нити жизни",
    "author": "Наталья Тимошенко",
    "description": "Судебно-медицинский эксперт Валерия Горяева думала, что уже потеряла способность удивляться, но, когда на ее столе оказалось тело молодой женщины, после смерти превратившейся в высохшую старуху, Лера изменила мнение. Только следователю совсем не хочется вешать на себя очередной глухарь, ведь признаков насильственной смерти нет, а возраст женщины он считает просто ошибкой эксперта. Чтобы восстановить свое доброе имя, Лера решает самостоятельно разобраться в этом сложном деле. На помощь ей приходит майор Павлов, который тоже не любит непонятных смертей. Вдвоем им предстоит отыскать таинственного преступника, ведь вскоре они понимают: на одной жертве он не остановится. И либо убийца обладает какими-то сверхъестественными способностями, либо… он и вовсе не человек. А в таком случае без содействия сотрудника Института исследования необъяснимого не обойтись.",
    "rating": {
      "value": 4.7,
      "votes": 108
    },
    "price": 200
  },
  {
    "id": 14,
    "genre": "science_fiction",
    "cover": "../source/book_pics/who.png",
    "title": "Кто не спрятался. История одной компании",
    "author": "Яна Вагнер",
    "description": "Яне Вагнер принес известность роман «Вонгозеро», который вошел в лонг-листы премий «НОС» и «Национальный бестселлер», был переведен на 11 языков и стал финалистом премий Prix Bob Morane и журнала Elle. Сегодня по нему снимается телесериал.\n\nНовый роман «Кто не спрятался» – это история девяти друзей, приехавших в отель на вершине снежной горы. Они знакомы целую вечность, они успешны, счастливы и готовы весело провести время. Но утром оказывается, что ледяной дождь оставил их без связи с миром. Казалось бы – такое приключение! Вот только недалеко от входа лежит одна из них, пронзенная лыжной палкой. Всё, что им остается, – зажечь свечи, разлить виски и посмотреть друг другу в глаза.\n\nЭто триллер, где каждый боится только самого себя. Детектив, в котором не так уж важно, кто преступник. Психологическая драма, которая вытянула на поверхность все старые обиды.\n\nСодержит нецензурную брань.",
    "rating": {
      "value": 4.2,
      "votes": 1208
    },
    "price": 400
  },
  {
    "id": 15,
    "genre": "science_fiction",
    "cover": "../source/book_pics/alibi.png",
    "title": "Алиби. Искусство обмана",
    "author": "Павел Рубцов",
    "description": "Преуспевающий сценарист Петр Решетников был хорошо известен в мире российской киноиндустрии. Но там проявлялась лишь одна грань его таланта. Только узкий круг посвященных знал, что Решетников владеет агентством, которое придумывает и создает алиби неверным супругам, проворовавшимся дельцам и проштрафившимся политикам. Он привык к роли манипулятора и, без преувеличения, властителя судеб. И не предполагал, что однажды сам станет марионеткой в безжалостных руках по-настоящему страшных людей. А началось все с момента, когда в агентство за алиби пришла его собственная любимая жена.\n\nЛитературный ремейк мелодраматического сериала Первого канала «Алиби». Сюжет порадует любителей авантюрных историй. В сериале в главных ролях играют Евгений Стычкин («Гоголь. Начало», «Максимальный удар», «Троцкий»), Ольга Сутулова («Снег и пепел», «Ленинград»,»Рожденная звездой»), Варвара Бородина («Молодежка»).",
    "rating": {
      "value": 3.5,
      "votes": 12
    },
    "price": 199
  },
  {
    "id": 16,
    "genre": "science_fiction",
    "cover": "../source/book_pics/irreversible.png",
    "title": "Невозвратимое",
    "author": "Алиса Арчер",
    "description": "В одной из комнат Центра Исследования Аномалий никогда не горит свет. Профессор Вяземский знает, что скрывается за ее дверями. У человечества осталось мало времени, удастся ли найти способ остановить аномалии, прежде чем они поглотят планету? Как быть, если для спасения нужно выступить против закона и человечности?",
    "rating": {
      "value": 4.4,
      "votes": 212
    },
    "price": 239
  },
  {
    "id": 17,
    "genre": "science_fiction",
    "cover": "../source/book_pics/twilight.png",
    "title": "Полумрак",
    "author": "Алексей Котаев",
    "description": "Подземный город, накрытый непроницаемым бетонным куполом. Люди, что живут в этом городе, поколениями сменяя друг-друга. Все счастливы, все в безопасности. Каждый живет свою меленькую жизнь, не желая что-то менять. Семен тоже живет свою маленькую жизнь: работает, служит, верит... Самый обычный человек, в самом обычном, для такого человека, городе. И все в его жизни идет хорошо. Пока однажды Семен не встречается со смертью. Глаза молодого парня открываются широко и он понимает, что весь город - обман. Созданный с одной единственной целью...",
    "rating": {
      "value": 4.8,
      "votes": 8
    },
    "price": 199
  },
  {
    "id": 18,
    "genre": "detective",
    "cover": "../source/book_pics/nights.png",
    "title": "Ночи с Камелией",
    "author": "Лариса Соболева",
    "description": "Графиня Маргарита Ростовцева мечтает поучаствовать в официальном следствии и знакомится с начальником сыскной полиции Зыбиным, занятым расследованием убийства дворянина Долгополова. Мотивы преступления не ясны. По городу ходит легенда о доступной женщине – якобы очень искусной в любви и прячущей свое лицо. Многие господа ищут встреч с нею и желают раскрыть ее инкогнито. Тем временем появляются еще две жертвы. Может быть, виновница убийств та самая Камелия – содержанка высшего ранга. Говорят, будто мужчины готовы на все ради ее благосклонности… Этот детективный сюжет легко ложится в канву романа современной писательницы Софии. Потому что она сама оказывается в центре подобных событий: некая дамочка убивает на дороге богатых мужчин и забирает их дорогие автомобили…\n\nКнига также выходила под названием «Исповедь Камелии».",
    "rating": {
      "value": 4.6,
      "votes": 38
    },
    "price": 169
  },
  {
    "id": 19,
    "genre": "detective",
    "cover": "../source/book_pics/bad_child.png",
    "title": "Плохой ребенок",
    "author": "Генри Сирил",
    "description": "Он ждал этого момента. Он следил за ней, чтобы стать ее кошмаром, ее судьей, ее палачом. Обычная месть была ему неинтересна…\n\nКогда известная художница Грейс Хейли случайно встретила на улице странного молодого человека, она сразу поняла: это он! Брошенный ею сын, от которого она избавилась, боясь испортить себе будущую карьеру. Она искала его все последние годы, и вот он нашелся. Но как же не похож он на того, кого она себе представляла! С этого момента жизнь Грейс превратилась в настоящий ад. Сын вымогал у нее деньги на наркотики, рассорил с мужем, сделал соучастницей преступления… Ставшая в один миг несчастной, Грейс, наконец, решает выяснить, кто же он на самом деле, ее мучитель. Открывшаяся правда не оставила отчаявшейся женщине выбора…\n\nЭта история обнажает самые смачные пороки, в которых безнадежно погрязли люди – успешные и, на первый взгляд, вполне здоровые…\n\nАвтор, словно хирургическим инструментом, вскрывает душевные нарывы и тайные мысли героев, проникая в самые темные уголки их воспаленного сознания. И только неожиданный финал, как суровый приговор, ставит точку в этой трагической истории…\n\n«Это один из самых захватывающих триллеров! Автор идеально прописывает сюжет и держит в напряжении до самого конца». – yarik_smiley\n\n«Ищете впечатляющий триллер? Вам нужна эта книга! Не все вам может понравится, с чем-то вы можете не согласиться, НО яркие эмоции вам обеспечены!» – ng_life.books\n\n«Триллерам Сирила свойственен эффект „делирия“, в который впадает читатель за счет искусно созданного автором психологического воздействия… Я люблю читать триллеры автора. Это всегда всплеск эмоций, адреналин, сюжетные твисты и эффект неожиданности». – Madina_bookaholic",
    "rating": {
      "value": 3.3,
      "votes": 11
    },
    "price": 209
  },
  {
    "id": 20,
    "genre": "detective",
    "cover": "../source/book_pics/heirs.png",
    "title": "Наследники",
    "author": "Павел Астахов",
    "description": "Умер известный деятель культуры, писатель и коллекционер Андрей Протасов. Из родственников у него остались вдова и дочь-инвалид. Все его квартиры и дачи, банковские счета, а также бесценные раритеты по наследству должны перейти им двоим.\n\nНо в день открытия завещания случилось нечто необъяснимое. Выяснилось, что незадолго до смерти Протасов составил еще одно закрытое завещание, согласно которому всё переходит в собственность совершенно незнакомым людям. Вдова и дочь остались без жилья, без средств к существованию.\n\nЧто же случилось с Андреем Протасовым незадолго до его кончины? Действительно ли он так круто изменил свое решение? Поиском ответов на эти вопросы занялся известный адвокат Артем Павлов…",
    "rating": {
      "value": 4.3,
      "votes": 81
    },
    "price": 319
  },
  {
    "id": 21,
    "genre": "detective",
    "cover": "../source/book_pics/victim.png",
    "title": "Глазами жертвы",
    "author": "Майк Омер",
    "description": "Продолжение бестселлеров «Внутри убийцы» (самый популярный роман в России в 2020 г.) и «Заживо в темноте». В этом романе многолетний кошмар Зои Бентли наконец-то закончится. Она найдет ответы на все вопросы…\n\nОн – убийца-маньяк, одержимый ею.\n\nОна – профайлер ФБР, идущая по его следу.\n\nОна может думать, как убийца.\n\nПотому что когда-то была его жертвой..\n\nУБИЙЦА, ПЬЮЩИЙ КРОВЬ СВОИХ ЖЕРТВ?\n\nПрофайлер ФБР Зои Бентли и ее напарник, агент Тейтум Грей повидали в жизни всякое. И все же при виде тела этой мертвой девушки даже их пробирала дрожь.\n\nВАМПИР? – ВРЯД ЛИ. НО И НЕ ЧЕЛОВЕК\n\nПочерк убийства схож с жуткими расправами Рода Гловера – маньяка, за которым они гоняются уже не первый месяц. Зои уверена – это его рук дело. Какие же персональные демоны, из каких самых темных глубин подсознания, могут заставить совершать подобные ужасы? Ответ на этот вопрос – ключ ко всему.\n\nОДНАКО МНОГОЕ ВЫГЛЯДИТ СТРАННО\n\nУбийство произошло в доме, а не на улице. Жертве зачем-то несколько раз вводили в руку иглу. После смерти кто-то надел ей на шею цепочку с кулоном и укрыл одеялом. И главное: на месте убийства обнаружены следы двух разных пар мужских ботинок…",
    "rating": {
      "value": 4.8,
      "votes": 758
    },
    "price": 459
  }
]